<a href="https://colab.research.google.com/github/py-ram/git-basics/blob/main/02_Masai_School_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip3 install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.12/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.12/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [ ]:
import pandas as pd

In [ ]:
import pandas
print(pandas.__version__)
import numpy as np
print(np.__version__)

2.2.2
2.0.2

In [ ]:
import pandas as pd

In [ ]:
list1 = [88.5, 73.0, 91, 65.4]
print(list1)

[88.5, 73.0, 91, 65.4]

In [ ]:
scores = pd.Series([88.5, 73.0, 91, 65.4, "BALAJI"])
print(scores)

0      88.5
1      73.0
2        91
3      65.4
4    BALAJI
dtype: object

In [ ]:
scores = pd.Series([88.5, 73.0, 91, 65.4],
                   index=["Alice", "Bob", "Charlie", "Diana"])
print(scores)

Alice      88.5
Bob        73.0
Charlie    91.0
Diana      65.4
dtype: float64

In [ ]:
scores = pd.Series({
    "Alice":   88.5,
    "Bob":     73.0,
    "Charlie": 91.0,
    "Diana":   65.5
})
print(scores)

Alice      88.5
Bob        73.0
Charlie    91.0
Diana      65.5
dtype: float64

In [ ]:
scores = pd.Series({"Alice": 88.5, "Bob": 73.0, "Charlie": 91.0})
scores

Alice      88.5
Bob        73.0
Charlie    91.0
dtype: float64

In [ ]:
scores.values

array([88.5, 73. , 91. ])

In [ ]:
scores.index

Index(['Alice', 'Bob', 'Charlie'], dtype='object')

In [ ]:
print(scores.dtype)

float64

In [ ]:
scores["Alice"]

np.float64(88.5)

In [ ]:
scores = pd.Series({"Alice": 88.5, "Bob": 73.0, "Charlie": 91.0})

# Basic math
print(scores.mean())    # 84.17
print(scores.max())     # 91.0
print(scores.min())     # 73.0
print(scores.sum())     # 252.5

84.16666666666667
91.0
73.0
252.5

In [ ]:
scores.values + 5

array([93.5, 78. , 96. ])

In [ ]:
print(scores * 2)

Alice      177.0
Bob        146.0
Charlie    182.0
dtype: float64

In [ ]:
print(scores > 80)

Alice       True
Bob        False
Charlie     True
dtype: bool

In [ ]:
scores = pd.Series(
    {"Alice": 88.5, "Bob": 73.0},
    name="Exam Score"     # Give the Series a name
)
print(scores)

Alice    88.5
Bob      73.0
Name: Exam Score, dtype: float64

In [ ]:
scores

Alice    88.5
Bob      73.0
Name: Exam Score, dtype: float64

In [ ]:
import pandas as pd

data = {
    "Age":   [20, 21, 19, 22],
    "Score": [88.5, 73.0, 91.0, 65.5],
    "Grade": ["A", "B", "A", "C"],
    "Name":  ["Alice", "Bob", "Charlie", "Diana"]
}

df = pd.DataFrame(data)
df

   Age  Score Grade     Name
0   20   88.5     A    Alice
1   21   73.0     B      Bob
2   19   91.0     A  Charlie
3   22   65.5     C    Diana

In [ ]:
data = [{"Name": "Alice",   "Age": 20, "Score": 88.5},
{"Name": "Bob",     "Age": 21, "Score": 73.0},
{"Name": "Charlie", "Age": 19, "Score": 91.0}]


df = pd.DataFrame(data)
df

      Name  Age  Score
0    Alice   20   88.5
1      Bob   21   73.0
2  Charlie   19   91.0

In [ ]:
data = [{"Name": "Alice",   "Age": 20, "Score": 88.5},
        {"Name": "Bob",     "Age": 21, "Score": 73.0},
        {"Name": "Charlie", "Age": 19, "scofer1": 91.0}]

# NaN - Not a Number.
df = pd.DataFrame(data)
df

      Name  Age  Score  scofer1
0    Alice   20   88.5      NaN
1      Bob   21   73.0      NaN
2  Charlie   19    NaN     91.0

In [ ]:
import numpy as np

arr = np.array([
    [20, 88.5],
    [21, 73.0],
    [19, 91.0]
])

df = pd.DataFrame(arr)
print(df)

      0     1
0  20.0  88.5
1  21.0  73.0
2  19.0  91.0

In [ ]:
import numpy as np

arr = np.array([
    [20, 88.5],
    [21, 73.0],
    [19, 91.0]
])

df = pd.DataFrame(arr, columns=["Age", "Score"])
df

    Age  Score
0  20.0   88.5
1  21.0   73.0
2  19.0   91.0

In [ ]:
df = pd.DataFrame(arr, columns=["Age", "Score"], index=[2, 3, "Balaji"])
df.head()

         Age  Score
2       20.0   88.5
3       21.0   73.0
Balaji  19.0   91.0

In [ ]:
df.iloc[index_Start:index_end, column_index_start: column_index_end]

NameError: name 'index_Start' is not defined

In [ ]:
df.iloc[2]

Age      19.0
Score    91.0
Name: Balaji, dtype: float64

In [ ]:
df.shape

(3, 2)

In [ ]:
data = {
    1:  ["Alice", "Bob", "Charlie", "Diana"],
    20:   [20, 21, 19, 22],
    40: [88.5, 73.0, 91.0, 65.5],
    "Grade": ["A", "B", "A", "C"]
}
df = pd.DataFrame(data, index = [10, "Balaji2", "Balaji3", "Balaji4"])
df

               1  20    40 Grade
10         Alice  20  88.5     A
Balaji2      Bob  21  73.0     B
Balaji3  Charlie  19  91.0     A
Balaji4    Diana  22  65.5     C

In [ ]:
df.iloc[1:2, 2:3]

           40
Balaji2  73.0

In [ ]:
df.loc[[10,"Balaji4"]]

          Name  Age  Score Grade
10       Alice   20   88.5     A
Balaji4  Diana   22   65.5     C

In [ ]:
df.iloc[0:2, 1:3]

         Age  Score
Balaji1   20   88.5
Balaji2   21   73.0

In [ ]:
df.loc[["Balaji1", "Balaji2"], ["Age", "Score"]]

         Age  Score
Balaji1   20   88.5
Balaji2   21   73.0

In [ ]:
df.loc[["Balaji1", "Balaji3", "Balaji4"], ["Name", "Grade"]]

            Name Grade
Balaji1    Alice     A
Balaji3  Charlie     A
Balaji4    Diana     C

In [ ]:
df.shape

(4, 4)

In [ ]:
df.columns

Index(['Name', 'Age', 'Score', 'Grade'], dtype='object')

In [ ]:
type(df.columns)

pandas.core.indexes.base.Index

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df.dtypes

Name      object
Age        int64
Score    float64
Grade     object
dtype: object

In [ ]:
# Object -- Irs a string type
# INT - intezer

In [ ]:
df

      Name  Age  Score Grade
0    Alice   20   88.5     A
1      Bob   21   73.0     B
2  Charlie   19   91.0     A
3    Diana   22   65.5     C

# loc and iloc

In [ ]:
df.iloc[0]

Name     Alice
Age         20
Score     88.5
Grade        A
Name: 0, dtype: object

In [ ]:
df.iloc[2]

Name     Charlie
Age           19
Score       91.0
Grade          A
Name: 2, dtype: object

In [ ]:
df.iloc[5]

IndexError: single positional indexer is out-of-bounds

In [ ]:
df

      Name  Age  Score Grade
0    Alice   20   88.5     A
1      Bob   21   73.0     B
2  Charlie   19   91.0     A
3    Diana   22   65.5     C

In [ ]:
df.iloc[0:2]

    Name  Age  Score Grade
0  Alice   20   88.5     A
1    Bob   21   73.0     B

In [ ]:
df.iloc[0:4]

      Name  Age  Score Grade
0    Alice   20   88.5     A
1      Bob   21   73.0     B
2  Charlie   19   91.0     A
3    Diana   22   65.5     C

In [ ]:
df.iloc[0:2, 0:2]

    Name  Age
0  Alice   20
1    Bob   21

In [ ]:
df

      Name  Age  Score Grade
0    Alice   20   88.5     A
1      Bob   21   73.0     B
2  Charlie   19   91.0     A
3    Diana   22   65.5     C

In [ ]:
df.iloc[1:3, 0:2]

      Name  Age
1      Bob   21
2  Charlie   19

In [ ]:
df[0]

KeyError: 0

In [ ]:
list1 = ["balaji", "Mounika", "Surya"]
list1[0]

'balaji'

In [ ]:
df["Name"]

0      Alice
1        Bob
2    Charlie
3      Diana
Name: Name, dtype: object

In [ ]:
df["Age"]

0    20
1    21
2    19
3    22
Name: Age, dtype: int64

In [ ]:
df["Grade"]

0    A
1    B
2    A
3    C
Name: Grade, dtype: object

In [ ]:
for i in df.columns:
    print(i)
    print(df[i])

Name
0      Alice
1        Bob
2    Charlie
3      Diana
Name: Name, dtype: object
Age
0    20
1    21
2    19
3    22
Name: Age, dtype: int64
Score
0    88.5
1    73.0
2    91.0
3    65.5
Name: Score, dtype: float64
Grade
0    A
1    B
2    A
3    C
Name: Grade, dtype: object

In [ ]:
df = pd.read_csv("/content/Titanic-Dataset.csv", sep= ",")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
df = pd.read_csv("/content/Titanic-Dataset.csv", sep= ",", usecols=["PassengerId", "Name"])
df

     PassengerId                                               Name
0              1                            Braund, Mr. Owen Harris
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3                             Heikkinen, Miss. Laina
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5                           Allen, Mr. William Henry
..           ...                                                ...
886          887                              Montvila, Rev. Juozas
887          888                       Graham, Miss. Margaret Edith
888          889           Johnston, Miss. Catherine Helen "Carrie"
889          890                              Behr, Mr. Karl Howell
890          891                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [ ]:
df = pd.read_csv("/content/Titanic-Dataset.csv", sep= "")

In [ ]:
df = pd.read_csv("/content/Titanic-Dataset.csv", sep= ",")


# Immediately check what we have
print(df.shape)        # How many rows and columns?
print(df.columns)      # What are the column names?
print(df.head())       # What does the first few rows look like?

(891, 12)
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [ ]:
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Lets start data alysis with pandas

In [ ]:
import pandas as pd
import seaborn as sns

# Load the Titanic dataset
titanic = sns.load_dataset("titanic")

In [ ]:
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [ ]:
age = titanic[(titanic["age"]>10) & (titanic["age"]<60) ]
age

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
age[]

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
# Step 2  What are the columns?
print(titanic.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
len(titanic.columns)

15

In [ ]:
titanic.shape

(891, 15)

In [ ]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
# Single column  returns a Series
ages = titanic["age"]
print(type(ages))    # <class 'pandas.core.series.Series'>
print(ages.head())

<class 'pandas.core.series.Series'>
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
# Multiple columns  returns a DataFrame
# Pass a LIST of column names (notice the double brackets)
subset = titanic[[ "sex", "age", "survived"]]
subset.head()

      sex   age  survived
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0

In [ ]:
subset.head(10)

      sex   age  survived
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0
5    male   NaN         0
6    male  54.0         0
7    male   2.0         0
8  female  27.0         1
9  female  14.0         1

In [ ]:
[ "sex", "age", "survived"]

['sex', 'age', 'survived']

In [ ]:
subset = titanic[ "sex", "age", "survived"]

KeyError: ('sex', 'age', 'survived')

In [ ]:
ages = titanic["age"]
print(type(ages))    # <class 'pandas.core.series.Series'>
print(ages.head())

<class 'pandas.core.series.Series'>
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
ages = titanic[["age"]]
print(type(ages))    # <class 'pandas.core.series.Series'>
print(ages.head())

<class 'pandas.core.frame.DataFrame'>
    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
# Get only numeric columns
numeric_cols = titanic.select_dtypes(include="number")
print(numeric_cols.columns)

Index(['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

In [ ]:
# Get only numeric columns
numeric_cols = titanic.select_dtypes(include="object")
print(numeric_cols.columns)

Index(['sex', 'embarked', 'who', 'embark_town', 'alive'], dtype='object')

In [ ]:
numeric_cols

        sex embarked    who  embark_town alive
0      male        S    man  Southampton    no
1    female        C  woman    Cherbourg   yes
2    female        S  woman  Southampton   yes
3    female        S  woman  Southampton   yes
4      male        S    man  Southampton    no
..      ...      ...    ...          ...   ...
886    male        S    man  Southampton    no
887  female        S  woman  Southampton   yes
888  female        S  woman  Southampton    no
889    male        C    man    Cherbourg   yes
890    male        Q    man   Queenstown    no

[891 rows x 5 columns]

In [ ]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
{"pclass": "ticket_class",
 "sibsp": "sibling_spouses",
 "parch": "parents_children"}

In [ ]:
titanic_renamed = titanic.rename(columns={"pclass": "ticket_class",
 "sibsp": "sibling_spouses",
 "parch": "parents_children"})

titanic_renamed

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
titanic.rename(columns={"pclass": "ticket_class",
 "sibsp": "sibling_spouses",
 "parch": "parents_children"}, inplace=True)

In [ ]:
titanic.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# Drop duplicate/redundant columns
# 'alive' duplicates 'survived', 'class' duplicates 'pclass'
clean = titanic.drop(columns=["alive", "class", "embark_town", "adult_male"])
print(clean.shape)   # (891, 11)  down from 15 columns

(891, 11)

In [ ]:
clean.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,who,deck,alone
0,0,3,male,22.0,1,0,7.2500,S,man,NaN,False
1,1,1,female,38.0,1,0,71.2833,C,woman,C,False
2,1,3,female,26.0,0,0,7.9250,S,woman,NaN,True
3,1,1,female,35.0,1,0,53.1000,S,woman,C,False
4,0,3,male,35.0,0,0,8.0500,S,man,NaN,True

In [ ]:
titanic.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
titanic.iloc[0]

survived                      0
ticket_class                  3
sex                        male
age                        22.0
sibling_spouses               1
parents_children              0
fare                       7.25
embarked                      S
class                     Third
who                         man
adult_male                 True
deck                        NaN
embark_town         Southampton
alive                        no
alone                     False
Name: 0, dtype: object

In [ ]:
print(titanic.iloc[0:5])

   survived  ticket_class     sex   age  sibling_spouses  parents_children  \
0         0             3    male  22.0                1                 0
1         1             1  female  38.0                1                 0
2         1             3  female  26.0                0                 0
3         1             1  female  35.0                1                 0
4         0             3    male  35.0                0                 0

      fare embarked  class    who  adult_male deck  embark_town alive  alone
0   7.2500        S  Third    man        True  NaN  Southampton    no  False
1  71.2833        C  First  woman       False    C    Cherbourg   yes  False
2   7.9250        S  Third  woman       False  NaN  Southampton   yes   True
3  53.1000        S  First  woman       False    C  Southampton   yes  False
4   8.0500        S  Third    man        True  NaN  Southampton    no   True

In [ ]:
print(titanic.iloc[[0, 5, 10]])

    survived  ticket_class     sex   age  sibling_spouses  parents_children  \
0          0             3    male  22.0                1                 0
5          0             3    male   NaN                0                 0
10         1             3  female   4.0                1                 1

       fare embarked  class    who  adult_male deck  embark_town alive  alone
0    7.2500        S  Third    man        True  NaN  Southampton    no  False
5    8.4583        Q  Third    man        True  NaN   Queenstown    no   True
10  16.7000        S  Third  child       False    G  Southampton   yes  False

In [ ]:
# Last row
print(titanic.iloc[-1])

survived                     0
ticket_class                 3
sex                       male
age                       32.0
sibling_spouses              0
parents_children             0
fare                      7.75
embarked                     Q
class                    Third
who                        man
adult_male                True
deck                       NaN
embark_town         Queenstown
alive                       no
alone                     True
Name: 890, dtype: object

In [ ]:
# iloc[rows, columns] - both by position

In [ ]:
titanic.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
print(titanic.iloc[0, 2])

male

In [ ]:
print(titanic.iloc[0:5, 0:3])

   survived  ticket_class     sex
0         0             3    male
1         1             1  female
2         1             3  female
3         1             1  female
4         0             3    male

In [ ]:
print(titanic.iloc[[0, 10, 25], [0, 2, 6]])

    survived     sex     fare
0          0    male   7.2500
10         1  female  16.7000
25         1  female  31.3875

# Loc - Label based

In [ ]:
titanic.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
print(titanic.loc[0])

survived                      0
ticket_class                  3
sex                        male
age                        22.0
sibling_spouses               1
parents_children              0
fare                       7.25
embarked                      S
class                     Third
who                         man
adult_male                 True
deck                        NaN
embark_town         Southampton
alive                        no
alone                     False
Name: 0, dtype: object

In [ ]:
print(titanic.loc[0:4])

   survived  ticket_class     sex   age  sibling_spouses  parents_children  \
0         0             3    male  22.0                1                 0
1         1             1  female  38.0                1                 0
2         1             3  female  26.0                0                 0
3         1             1  female  35.0                1                 0
4         0             3    male  35.0                0                 0

      fare embarked  class    who  adult_male deck  embark_town alive  alone
0   7.2500        S  Third    man        True  NaN  Southampton    no  False
1  71.2833        C  First  woman       False    C    Cherbourg   yes  False
2   7.9250        S  Third  woman       False  NaN  Southampton   yes   True
3  53.1000        S  First  woman       False    C  Southampton   yes  False
4   8.0500        S  Third    man        True  NaN  Southampton    no   True

In [ ]:
print(titanic.loc[0, "age"])

22.0

In [ ]:
print(titanic.loc[0:4, ["sex", "age", "survived"]])

      sex   age  survived
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0

In [ ]:
titanic.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
titanic['survived'] == 1 #This is my fiulterug logic.

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: survived, Length: 891, dtype: bool

In [ ]:
survivors = titanic[titanic['survived'] == 1] # Filter your data.
survivors

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [ ]:
survivors = titanic[titanic['survived'] == 1] # Filter your data.
survivors.reset_index()
survivors.reset_index()

,index,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
1,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
2,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
3,8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
4,9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
337,875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
338,879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
339,880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
340,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
341,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [ ]:
survivors.loc[1]

survived                    1
ticket_class                1
sex                    female
age                      38.0
sibling_spouses             1
parents_children            0
fare                  71.2833
embarked                    C
class                   First
who                     woman
adult_male              False
deck                        C
embark_town         Cherbourg
alive                     yes
alone                   False
Name: 1, dtype: object

In [ ]:
survivors.iloc[341]

survived                    1
ticket_class                1
sex                      male
age                      26.0
sibling_spouses             0
parents_children            0
fare                     30.0
embarked                    C
class                   First
who                       man
adult_male               True
deck                        C
embark_town         Cherbourg
alive                     yes
alone                    True
Name: 889, dtype: object

In [ ]:
# Use pclass as the index (not realistic, just for demonstration)
titanic_indexed = titanic.set_index("embarked")
titanic_indexed.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,class,who,adult_male,deck,embark_town,alive,alone
embarked,,,,,,,,,,,,,,
S,0,3,male,22.0,1,0,7.2500,Third,man,True,NaN,Southampton,no,False
C,1,1,female,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,yes,False
S,1,3,female,26.0,0,0,7.9250,Third,woman,False,NaN,Southampton,yes,True
S,1,1,female,35.0,1,0,53.1000,First,woman,False,C,Southampton,yes,False
S,0,3,male,35.0,0,0,8.0500,Third,man,True,NaN,Southampton,no,True

# Filtering of data

In [ ]:
titanic.head(10)

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [ ]:
titanic['sex'] == "female" # Boolean Masking.

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: sex, Length: 891, dtype: bool

In [ ]:
titanic[titanic['sex'] == "female" ]

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
is_female = titanic["sex"] == "female"
titanic[is_female]

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
female_passengers = titanic[titanic["sex"] == "female"]
print(female_passengers.shape)   # (314, 15)

(314, 15)

In [ ]:
# Equal to
titanic[titanic["sex"] == "female"]

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
# Not equal to
titanic[titanic["sex"] != "male"]

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
# Greater than
titanic[titanic["age"] > 60]

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
33,0,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
170,0,1,male,61.0,0,0,33.5000,S,First,man,True,B,Southampton,no,True
252,0,1,male,62.0,0,0,26.5500,S,First,man,True,C,Southampton,no,True
275,1,1,female,63.0,1,0,77.9583,S,First,woman,False,D,Southampton,yes,False
280,0,3,male,65.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
326,0,3,male,61.0,0,0,6.2375,S,Third,man,True,NaN,Southampton,no,True
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
456,0,1,male,65.0,0,0,26.5500,S,First,man,True,E,Southampton,no,True
483,1,3,female,63.0,0,0,9.5875,S,Third,woman,False,NaN,Southampton,yes,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
545,0,1,male,64.0,0,0,26.0000,S,First,man,True,NaN,Southampton,no,True
555,0,1,male,62.0,0,0,26.5500,S,First,man,True,NaN,Southampton,no,True
570,1,2,male,62.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,yes,True
625,0,1,male,61.0,0,0,32.3208,S,First,man,True,D,Southampton,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
672,0,2,male,70.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
745,0,1,male,70.0,1,1,71.0000,S,First,man,True,B,Southampton,no,False
829,1,1,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# Less than
titanic[titanic["fare"] < 10]

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
877,0,3,male,19.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
titanic.head()

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:

# Greater than or equal to
titanic[titanic["ticket_class"] >= 2]

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:

# Less than or equal to
titanic[titanic["age"] <= 18]

In [ ]:
elderly = titanic[titanic["age"] > 60]
elderly

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
33,0,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
170,0,1,male,61.0,0,0,33.5000,S,First,man,True,B,Southampton,no,True
252,0,1,male,62.0,0,0,26.5500,S,First,man,True,C,Southampton,no,True
275,1,1,female,63.0,1,0,77.9583,S,First,woman,False,D,Southampton,yes,False
280,0,3,male,65.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
326,0,3,male,61.0,0,0,6.2375,S,Third,man,True,NaN,Southampton,no,True
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
456,0,1,male,65.0,0,0,26.5500,S,First,man,True,E,Southampton,no,True
483,1,3,female,63.0,0,0,9.5875,S,Third,woman,False,NaN,Southampton,yes,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
545,0,1,male,64.0,0,0,26.0000,S,First,man,True,NaN,Southampton,no,True
555,0,1,male,62.0,0,0,26.5500,S,First,man,True,NaN,Southampton,no,True
570,1,2,male,62.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,yes,True
625,0,1,male,61.0,0,0,32.3208,S,First,man,True,D,Southampton,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
672,0,2,male,70.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
745,0,1,male,70.0,1,1,71.0000,S,First,man,True,B,Southampton,no,False
829,1,1,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
print(f"Passengers over 60: {len(elderly)}")
print(elderly[["sex", "age", "ticket_class", "survived"]].head(10))

Passengers over 60: 22
        sex   age  ticket_class  survived
33     male  66.0             2         0
54     male  65.0             1         0
96     male  71.0             1         0
116    male  70.5             3         0
170    male  61.0             1         0
252    male  62.0             1         0
275  female  63.0             1         1
280    male  65.0             3         0
326    male  61.0             3         0
438    male  64.0             1         0

In [ ]:
titanic["sex"] == "female" # All the females

titanic["ticket_class"] == 1 # all the passengers which has ticket_class 1

In [ ]:
(titanic["sex"] == "female") & (titanic["ticket_class"] == 1)

In [ ]:
first_class_women = titanic[(titanic["sex"] == "female") & (titanic["ticket_class"] == 1) ]

In [ ]:
first_class_women

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [ ]:
first_class_women_survived = titanic[(titanic["sex"] == "female") & \
                                    (titanic["ticket_class"] == 1) & \
                                     (titanic["survived"] == 0)]

first_class_women_survived

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
177,0,1,female,50.0,0,0,28.7125,C,First,woman,False,C,Cherbourg,no,True
297,0,1,female,2.0,1,2,151.5500,S,First,child,False,C,Southampton,no,False
498,0,1,female,25.0,1,2,151.5500,S,First,woman,False,C,Southampton,no,False

In [ ]:
# Passengers who were either very young OR very old
extremes = titanic[
    (titanic["age"] < 10) | (titanic["age"] > 70)
]
print(f"Very young or very old passengers: {len(extremes)}")
print(extremes[["sex", "age", "survived"]])

Very young or very old passengers: 67
        sex    age  survived
7      male   2.00         0
10   female   4.00         1
16     male   2.00         0
24   female   8.00         0
43   female   3.00         1
..      ...    ...       ...
831    male   0.83         1
850    male   4.00         0
851    male  74.00         0
852  female   9.00         0
869    male   4.00         1

[67 rows x 3 columns]

In [ ]:
# Passengers from Cherbourg OR Queenstown (not Southampton)
not_southampton = titanic[
    (titanic["embarked"] == "C") | (titanic["embarked"] == "Q")
]
print(len(not_southampton))   # 270

245

In [ ]:
not_southampton

,survived,ticket_class,sex,age,sibling_spouses,parents_children,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df2 = titanic[
    (titanic["pclass"] == 1) | (titanic["pclass"] == 2)
]
df2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [ ]:
upper_class = titanic[titanic["pclass"].isin([1, 2])]
print(upper_class.shape)   # (400, 15)

(400, 15)

In [ ]:
# Combine isin with other conditions
upper_class_women = titanic[
    (titanic["pclass"].isin([1, 2])) &
    (titanic["sex"] == "female")
]
upper_class_women

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [ ]:
# The long way  passengers aged 20 to 30
titanic[(titanic["age"] >= 20) & (titanic["age"] <= 30)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [ ]:
titanic[titanic["age"].between(20, 30)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

# Filtering on missing values

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
missing_age = titanic[titanic["age"].isna()]
print(f"Passengers with unknown age: {len(missing_age)}")

Passengers with unknown age: 177

In [ ]:
known_age = titanic[titanic["age"].notna()]
known_age

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# Find rows where age is missing
missing_age = titanic[titanic["age"].isna()]
print(f"Passengers with unknown age: {len(missing_age)}")   # 177

# Find rows where age is NOT missing
known_age = titanic[titanic["age"].notna()]
print(f"Passengers with known age: {len(known_age)}")       # 714

# Check if this group has a different survival rate
print(known_age["survived"].mean().round(2))    # 0.41
print(missing_age["survived"].mean().round(2))  # 0.29
# Interesting  passengers with unknown ages survived less often

Passengers with unknown age: 177
Passengers with known age: 714
0.41
0.29

In [ ]:
result = titanic[(titanic["age"] > 18) & (titanic["pclass"] == 1)]

# DataFrame Sorting

In [ ]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# Sort by fare  cheapest first (ascending is default)
titanic_sorted = titanic.sort_values("fare")
titanic_sorted.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
815,0,1,male,NaN,0,0,0.0,S,First,man,True,B,Southampton,no,True
806,0,1,male,39.0,0,0,0.0,S,First,man,True,A,Southampton,no,True
413,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
481,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
302,0,3,male,19.0,0,0,0.0,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
titanic_sorted.reset_index(inplace=True)
titanic_sorted

,index,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True
1,806,0,1,male,39.0,0,0,0.0000,S,First,man,True,A,Southampton,no,True
2,413,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
3,481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
4,302,0,3,male,19.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
887,341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
888,737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
889,679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
890,258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True

In [ ]:

print(titanic_sorted[["sex", "pclass", "fare", "survived"]].head())

In [ ]:
# Sort by fare  most expensive first (descending)
titanic_sorted = titanic.sort_values("fare", ascending=False)
print(titanic_sorted[["sex", "pclass", "fare", "survived"]].head())

        sex  pclass      fare  survived
679    male       1  512.3292         1
258  female       1  512.3292         1
737    male       1  512.3292         1
88   female       1  263.0000         1
438    male       1  263.0000         0

In [ ]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
titanic.sort_values("pclass")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
857,1,1,male,51.0,0,0,26.5500,S,First,man,True,E,Southampton,yes,True
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
867,0,1,male,31.0,0,0,50.4958,S,First,man,True,A,Southampton,no,True
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
839,1,1,male,NaN,0,0,29.7000,C,First,man,True,C,Cherbourg,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False

In [ ]:
titanic.sort_values(["pclass", "age"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
445,1,1,male,4.00,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
802,1,1,male,11.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
435,1,1,female,14.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
# Sort by class first, then by age within each class
titanic.sort_values(["pclass", "age"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
445,1,1,male,4.00,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
802,1,1,male,11.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
435,1,1,female,14.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
sorted_df = titanic.sort_values(
    ["pclass", "age"],
    ascending=[True, True]   # both ascending
)
sorted_df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
445,1,1,male,4.00,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
802,1,1,male,11.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
435,1,1,female,14.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
sorted_df = titanic.sort_values(
    ["pclass", "age"],
    ascending=[False, True]   # both ascending
)
sorted_df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
164,0,3,male,1.00,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
172,1,3,female,1.00,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
766,0,1,male,NaN,0,0,39.6000,C,First,man,True,NaN,Cherbourg,no,True
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True
839,1,1,male,NaN,0,0,29.7000,C,First,man,True,C,Cherbourg,yes,True
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False

In [ ]:
"Find first-class women who survived,
 sort them by what they paid,
 give me a clean table with just sex, age, and fare."

In [ ]:
# Step 1  Filter: first class, female, survived
result = titanic[
    (titanic["pclass"] == 1) &
    (titanic["sex"] == "female") &
    (titanic["survived"] == 1)
]

# Step 2  Select only the columns we need
result = result[["sex", "age", "fare"]]

# Step 3  Sort by fare, highest first
result = result.sort_values("fare", ascending=False)

print(result.head(10))
print(f"\nTotal: {len(result)} first-class female survivors")

        sex   age      fare
258  female  35.0  512.3292
88   female  23.0  263.0000
341  female  24.0  263.0000
311  female  18.0  262.3750
742  female  21.0  262.3750
299  female  50.0  247.5208
380  female  42.0  227.5250
716  female  38.0  227.5250
700  female  18.0  227.5250
730  female  29.0  211.3375

Total: 91 first-class female survivors

In [ ]:
# The clean one-liner version
result = (
    titanic[
        (titanic["pclass"] == 1) &
        (titanic["sex"] == "female") &
        (titanic["survived"] == 1)
    ]
    [["sex", "age", "fare"]]
    .sort_values("fare", ascending=False)
)

print(result.head(10))

        sex   age      fare
258  female  35.0  512.3292
88   female  23.0  263.0000
341  female  24.0  263.0000
311  female  18.0  262.3750
742  female  21.0  262.3750
299  female  50.0  247.5208
380  female  42.0  227.5250
716  female  38.0  227.5250
700  female  18.0  227.5250
730  female  29.0  211.3375

In [ ]:
"What was the survival rate by passenger class?"

'What was the survival rate by passenger class?'

In [ ]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
titanic[titanic["pclass"] == 1]["survived"].mean()

np.float64(0.6296296296296297)

In [ ]:
titanic[titanic["pclass"] == 2]["survived"].mean()

np.float64(0.47282608695652173)

In [ ]:
titanic[titanic["pclass"] == 3]["survived"].mean()

np.float64(0.24236252545824846)

In [ ]:
pclass = [1, 2, 3]

for i in pclass:
    group = titanic[titanic["pclass"]==i]
    rate = group['survived'].mean()
    print(rate)

0.6296296296296297
0.47282608695652173
0.24236252545824846